# **Pandas Cheatsheet: Most Useful Functions and Methods**

**Python** is an interpreted high-level general-purpose programming language. Python is easy to learn and has some really powerful data-centric libraries. Pandas is one of the most important libraries in Python for Data Manipulation,  Analysis, and Data Science.

This **Cheatsheet** is a quick guide to the Python Data Analysis Library : **Pandas**

**We will be performing EDA on a Employee Management Dataset using Pandas**

* Using **import** keyword to import **Pandas**

In [ ]:
import pandas as pd

* **read_csv()** : To read Dataset(csv_files) and store it into the variable **df**.

In [ ]:
df = pd.read_csv("/content/blog_dataset.csv")

*   **head(n)** : To print first n rows of the dataframe(by default n = 5).

In [ ]:
df.head(10)

     Name  Age       City  ...  Gender City temperature Salary
0    Alam   29     Indore  ...    Male             35.5  50000
1   Rohit   23  New Delhi  ...    Male             39.0  85000
2   Bimla   35     Rohtak  ...  Female             39.7  20000
3   Rahul   25    Kolkata  ...    Male             36.5  40000
4  Chaman   32    Chennai  ...    Male             41.1  65000
5   Vivek   38   Gurugram  ...    Male             38.9  35000
6   Charu   29  New Delhi  ...  Female             39.0  52000
7  Ganesh   39      Patna  ...    Male              NaN  18000
8   Vivek   38   Gurugram  ...    Male             38.9  35000

[9 rows x 8 columns]

* **tail(n)** : To print the last n rows of the dataframe(by default n = 5).

In [ ]:
df.tail(10)

     Name  Age       City  ...  Gender City temperature Salary
0    Alam   29     Indore  ...    Male             35.5  50000
1   Rohit   23  New Delhi  ...    Male             39.0  85000
2   Bimla   35     Rohtak  ...  Female             39.7  20000
3   Rahul   25    Kolkata  ...    Male             36.5  40000
4  Chaman   32    Chennai  ...    Male             41.1  65000
5   Vivek   38   Gurugram  ...    Male             38.9  35000
6   Charu   29  New Delhi  ...  Female             39.0  52000
7  Ganesh   39      Patna  ...    Male              NaN  18000
8   Vivek   38   Gurugram  ...    Male             38.9  35000

[9 rows x 8 columns]

* **shape** : To find the number of rows & columns in the dataframe (rows , columns).

In [ ]:
df.shape

(9, 8)

* **size** : Returns the size of the dataframe (rows * columns).

In [ ]:
df.size

72

* **dtypes** : Returns the datatype of each column in the dataframe.

In [ ]:
df.dtypes

Name                 object
Age                   int64
City                 object
State                object
DOB                  object
Gender               object
City temperature    float64
Salary                int64
dtype: object

* **info()** : Gives the concise summary of the dataframe( Index, Datatype, Non - Null Count, Memory Usage).

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Name              9 non-null      object
 1   Age               9 non-null      int64
 2   City              9 non-null      object
 3   State             9 non-null      object
 4   DOB               9 non-null      object
 5   Gender            9 non-null      object
 6   City temperature  8 non-null      float64
 7   Salary            9 non-null      int64
dtypes: float64(1), int64(2), object(5)
memory usage: 704.0+ bytes

* **columns** : Gives a list of all the column names in the dataframe.

In [ ]:
df.columns

Index(['Name', 'Age', 'City', 'State', 'DOB', 'Gender', 'City temperature',
       'Salary'],
      dtype='object')

* **describe()** : Gives the statistical summary of the numerical columns in the dataframe.

In [ ]:
df.describe()

             Age  City temperature        Salary
count   9.000000          8.000000      9.000000
mean   32.000000         38.575000  44444.444444
std     5.894913          1.771803  21360.659582
min    23.000000         35.500000  18000.000000
25%    29.000000         38.300000  35000.000000
50%    32.000000         38.950000  40000.000000
75%    38.000000         39.175000  52000.000000
max    39.000000         41.100000  85000.000000

* **value_counts()** : Returns a series containing count of unique values in a column.

In [ ]:
df['City'].value_counts()

New Delhi    2
Gurugram     2
Kolkata      1
Rohtak       1
Patna        1
Indore       1
Chennai      1
Name: City, dtype: int64

* **loc[ : ]** : Used to select data by label(column names).

In [ ]:
df.loc[ : , ["Name", "DOB",  "Gender"]]

     Name         DOB  Gender
0    Alam  20-11-1991    Male
1   Rohit  19-09-1997    Male
2   Bimla  09-01-1985  Female
3   Rahul  19-09-1995    Male
4  Chaman  12-03-1988    Male
5   Vivek  22-06-1982    Male
6   Charu  18-03-1992  Female
7  Ganesh  07-12-1981    Male
8   Vivek  22-06-1982    Male

* **iloc[ : ]** : Used to select data by indices([rows , columns]).
If no value is assigned then the index starts from 0 and goes up.

In [ ]:
df.iloc[2:5, :4]

     Name  Age     City        State
2   Bimla   35   Rohtak      Haryana
3   Rahul   25  Kolkata  West Bengal
4  Chaman   32  Chennai   Tamil Nadu

* **sort_values(by = [..])** : Used to sort the columns(default = ascending).

In [ ]:
df.sort_values(by = ['Age'])

     Name  Age       City  ...  Gender City temperature Salary
1   Rohit   23  New Delhi  ...    Male             39.0  85000
3   Rahul   25    Kolkata  ...    Male             36.5  40000
0    Alam   29     Indore  ...    Male             35.5  50000
6   Charu   29  New Delhi  ...  Female             39.0  52000
4  Chaman   32    Chennai  ...    Male             41.1  65000
2   Bimla   35     Rohtak  ...  Female             39.7  20000
5   Vivek   38   Gurugram  ...    Male             38.9  35000
8   Vivek   38   Gurugram  ...    Male             38.9  35000
7  Ganesh   39      Patna  ...    Male              NaN  18000

[9 rows x 8 columns]

* **concat([...])** : Used to add two or more dataframes together(by deafult along the horizontal axis).

---

In [ ]:
hobby = ['Singing','Dancing','Sports','Reading','Dancing','Travelling','Gaming','Coding','Singing']
Hobby = pd.DataFrame({"Hobby":hobby})
New_df = pd.concat([df,Hobby],axis=1)

In [ ]:
New_df

     Name  Age       City  ... City temperature Salary       Hobby
0    Alam   29     Indore  ...             35.5  50000     Singing
1   Rohit   23  New Delhi  ...             39.0  85000     Dancing
2   Bimla   35     Rohtak  ...             39.7  20000      Sports
3   Rahul   25    Kolkata  ...             36.5  40000     Reading
4  Chaman   32    Chennai  ...             41.1  65000     Dancing
5   Vivek   38   Gurugram  ...             38.9  35000  Travelling
6   Charu   29  New Delhi  ...             39.0  52000      Gaming
7  Ganesh   39      Patna  ...              NaN  18000      Coding
8   Vivek   38   Gurugram  ...             38.9  35000     Singing

[9 rows x 9 columns]

* **groupby(S)[A].C** : Used for grouping columns and performing some operations.

    S = 'State', A = 'Salary', C = mean()

  Here, we are first grouping the data based on 'State' then calculating the 'Mean Salary' for each unique State.

---

In [ ]:
df.groupby('State')["Salary"].mean()

State
Bihar             18000
Delhi             68500
Haryana           30000
Madhya Pradesh    50000
Tamil Nadu        65000
West Bengal       40000
Name: Salary, dtype: int64

* **fillna(value)** : Used to fill the missing values in a column(s) with a constant value(Manually entered or statiscal).

In [ ]:
mean = df['City temperature'].mean()
df['City temperature'].fillna(mean, inplace = True)

In [ ]:
df

     Name  Age       City  ...  Gender City temperature Salary
0    Alam   29     Indore  ...    Male           35.500  50000
1   Rohit   23  New Delhi  ...    Male           39.000  85000
2   Bimla   35     Rohtak  ...  Female           39.700  20000
3   Rahul   25    Kolkata  ...    Male           36.500  40000
4  Chaman   32    Chennai  ...    Male           41.100  65000
5   Vivek   38   Gurugram  ...    Male           38.900  35000
6   Charu   29  New Delhi  ...  Female           39.000  52000
7  Ganesh   39      Patna  ...    Male           38.575  18000
8   Vivek   38   Gurugram  ...    Male           38.900  35000

[9 rows x 8 columns]

* **dropna()** : Used to remove the rows or columns with NAN values.

In [ ]:
New_df.dropna( axis = 0, inplace = True)

In [ ]:
New_df

     Name  Age       City  ... City temperature Salary       Hobby
0    Alam   29     Indore  ...             35.5  50000     Singing
1   Rohit   23  New Delhi  ...             39.0  85000     Dancing
2   Bimla   35     Rohtak  ...             39.7  20000      Sports
3   Rahul   25    Kolkata  ...             36.5  40000     Reading
4  Chaman   32    Chennai  ...             41.1  65000     Dancing
5   Vivek   38   Gurugram  ...             38.9  35000  Travelling
6   Charu   29  New Delhi  ...             39.0  52000      Gaming
8   Vivek   38   Gurugram  ...             38.9  35000     Singing

[8 rows x 9 columns]

* **query()** : Used to filter the data based on a condition.

In [ ]:
df.query('Salary >50000')

     Name  Age       City  ...  Gender City temperature Salary
1   Rohit   23  New Delhi  ...    Male             39.0  85000
4  Chaman   32    Chennai  ...    Male             41.1  65000
6   Charu   29  New Delhi  ...  Female             39.0  52000

[3 rows x 8 columns]